app/Http/Controllers/SettingsController.php

    public function index(Settings $settings)
    {
        if (auth()->user()->hasRole('admin')) {

            $curreciesArr = [];
            static::$currencies = require __DIR__.'/../../../config/money.php';

            foreach (static::$currencies as $key => $value) {
                array_push($curreciesArr, $key);
            }

            $jsfront = File::get(base_path('public/byadmin/front.js'));
            $jsback = File::get(base_path('public/byadmin/back.js'));
            $cssfront = File::get(base_path('public/byadmin/front.css'));
            $cssback = File::get(base_path('public/byadmin/back.css'));

            //$jsfront = file_get_contents(__DIR__.'/../../../public/byadmin/front.js');
            //dd($cssfront);

            $hasDemoRestaurants = Restorant::where('phone', '(530) 625-9694')->count() > 0;
---
select count(*) as aggregate from `restorants` where `phone` = '(530) 625-9694' and `restorants`.`deleted_at` is null